I can confirm this behavior as well

Command
`terraform import module.develop.module.cloudwatch_alarms.aws_cloudwatch_metric_alarm.foobar alarm-foobar`

Output
```
module.develop.module.cloudwatch_alarms.aws_cloudwatch_metric_alarm.foobar: Importing from ID "alarm-foobar"...
module.develop.module.cloudwatch_alarms.aws_cloudwatch_metric_alarm.foobar: Import prepared!
  Prepared aws_cloudwatch_metric_alarm for import
module.develop.module.cloudwatch_alarms.aws_cloudwatch_metric_alarm.foobar: Refreshing state... [id=alarm-foobar]

Error: Invalid count argument

  on terraform/phonism/networking/networking.tf line 105, in module "frontend_listener_rules":
 105:   count = length(module.frontend_listeners.listener_arns)

The "count" value depends on resource attributes that cannot be determined
until apply, so Terraform cannot predict how many instances will be created.
To work around this, use the -target argument to first apply only the
resources that the count depends on.
```


`terraform apply` or `terraform plan` contiunes to work correctly

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.develop.module.cloudwatch_alarms.aws_cloudwatch_metric_alarm.foobar will be created
  + resource "aws_cloudwatch_metric_alarm" "foobar" {
      + actions_enabled                       = true
      + alarm_description                     = "This metric monitors ec2 cpu utilization"
      + alarm_name                            = "develop-us-tg-phone-request-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "RequestCountPerTarget"
      + namespace                             = "AWS/EC2"
      + period                                = 60
      + statistic                             = "Sum"
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```